InformationRegisters/ИдентификаторыДокументовНаРаботаРоссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыДокументовНаРаботаРоссии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьСотрудникаПолучена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПодпись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрисоединенныйФайл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайлПечатнойФормы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыДокументовНаРаботаРоссии/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ИдентификаторДокумента(ПрисоединенныйФайл) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПрисоединенныйФайл", ПрисоединенныйФайл);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаРегистра.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.ИдентификаторыДокументовНаРаботаРоссии КАК ТаблицаРегистра
		|ГДЕ
		|	ТаблицаРегистра.ПрисоединенныйФайл = &ПрисоединенныйФайл";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Идентификатор;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДокументПоИдентификатору(Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторПРР", Идентификатор);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИдентификаторыДокументовНаРаботаРоссии.ПрисоединенныйФайл КАК ПрисоединенныйФайл
		|ИЗ
		|	РегистрСведений.ИдентификаторыДокументовНаРаботаРоссии КАК ИдентификаторыДокументовНаРаботаРоссии
		|ГДЕ
		|	ИдентификаторыДокументовНаРаботаРоссии.Идентификатор = &ИдентификаторПРР";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ПрисоединенныйФайл;
	
КонецФункции

Процедура ЗапомнитьИдентификатор(ПрисоединенныйФайл, Идентификатор) Экспорт
	
	Запись = РегистрыСведений.ИдентификаторыДокументовНаРаботаРоссии.СоздатьМенеджерЗаписи();
	Запись.ПрисоединенныйФайл = ПрисоединенныйФайл;
	Запись.Идентификатор = Идентификатор;
	Запись.ДатаОтправки = ТекущаяУниверсальнаяДата();
	Запись.ТребуетсяПодпись = Истина;
	Запись.Записать();
	
КонецПроцедуры

Процедура ЗапомнитьПолучениеПодписиСотрудика(Идентификатор, ДатаПодписи = Неопределено, Документ = Неопределено) Экспорт
	
	Если ДатаПодписи = Неопределено Тогда
		ДатаПодписи = Дата(1, 1, 1);
	КонецЕсли;
	
	Если Документ = Неопределено Тогда
		Документ = ДокументПоИдентификатору(Идентификатор);
	КонецЕсли;
	
	Если Документ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.ИдентификаторыДокументовНаРаботаРоссии.СоздатьМенеджерЗаписи();
	Запись.ПрисоединенныйФайл = Документ;
	Запись.Прочитать();
	
	Запись.ПодписьСотрудникаПолучена = ДатаПодписи;
	Запись.ТребуетсяПодпись = Ложь;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
